sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_pal.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

/*!
 * @file timing_pal.c
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 1.3, Taking address of near auto variable.
 * The code is not dynamically linked. An absolute stack address is obtained
 * when taking the address of the near auto variable. A source of error in
 * writing dynamic code is that the stack segment may be different from the data
 * segment.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 8.7, External could be made static.
 * Function is defined for usage by application code.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 10.1, Unpermitted operand to operator.
 * This is required to get the right returned status from the
 * initialization function.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 11.4, Conversion between a pointer and
 * integer type.
 * The cast is required to initialize a pointer with an unsigned long define,
 * representing an address.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 11.6, Cast from unsigned int to pointer.
 * The cast is required to initialize a pointer with an unsigned long define,
 * representing an address.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 11.3, Cast performed between a pointer to object type
 * and a pointer to a different object type.
 * This is needed for the extension of the user configuration structure, for which the actual type
 * cannot be known.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 11.5, Conversion from pointer to void to pointer to other type
 * This is needed for the extension of the user configuration structure, for which the actual type
 * cannot be known.
 *
 */

#include <stddef.h>
#include "timing_pal.h"
#include "timing_irq.h"
#include "device_registers.h"
#include "interrupt_manager.h"
#include "clock_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Runtime state of the Timer channel
 *
 * This structure is used by the driver for its internal logic
 * The application should make no assumptions about the content of this structure
 */
typedef struct
{
/*! @cond DRIVER_INTERNAL_USE_ONLY */
    uint32_t period;            /*!< To save timer channel period */
    uint32_t chanStartVal;      /*!< To save the moment that timer channel start new period */
    timer_chan_type_t chanType; /*!< To save timer channel notification type */
    timer_callback_t callback;  /*!< To save callback for channels notification */
    void * callbackParam;       /*!< To save callback parameter pointer.*/
    bool enableNotification;    /*!< To save enable channels notification */
/*! @endcond */
} timer_chan_state_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/
#if (defined(TIMING_OVER_LPIT))
    /* Table to save LPIT channel runtime state */
    static timer_chan_state_t s_lpitState[LPIT_INSTANCE_COUNT][LPIT_TMR_COUNT];
    /* Table to save LPIT IRQ number */
    static const IRQn_Type s_lpitIrq[LPIT_INSTANCE_COUNT][LPIT_TMR_COUNT] = {LPIT_IRQS};
    /* The maximum value of compare register */
    #define LPIT_COMPARE_MAX (LPIT_TMR_TVAL_TMR_VAL_MASK)
#endif

#if (defined(TIMING_OVER_LPTMR))
    /* The maximum value of LPTMR channel number */
    #define LPTMR_TMR_COUNT LPTMR_IRQS_CH_COUNT
    /* Table to save LPTMR channel runtime state */
    static timer_chan_state_t s_lptmrState[LPTMR_INSTANCE_COUNT][LPTMR_TMR_COUNT];
    /* Table to save LPTMR IRQ number */
    static const IRQn_Type s_lptmrIrq[LPTMR_INSTANCE_COUNT][LPTMR_TMR_COUNT]  = {LPTMR_IRQS};
    /* Table to save LPTMR clock source name */
    static lptmr_clocksource_t s_lptmrClockSource[LPTMR_INSTANCE_COUNT];
    /* Table to save LPTMR prescaler */
    static lptmr_prescaler_t s_lptmrPrescaler[LPTMR_INSTANCE_COUNT];
    /* Table to save LPTMR bypass prescaler enable */
    static bool s_lptmrBypassPrescaler[LPTMR_INSTANCE_COUNT];
    /* The maximum value of compare register */
    #define LPTMR_COMPARE_MAX (LPTMR_CMR_COMPARE_MASK)
#endif

#if (defined(TIMING_OVER_FTM))
    /*! @brief Table of base addresses for FTM instances. */
    FTM_Type * const ftmBase[FTM_INSTANCE_COUNT] = FTM_BASE_PTRS;
    /* Table to save FTM IRQ number */
    static const IRQn_Type s_ftmIrq[FTM_INSTANCE_COUNT][FTM_CONTROLS_COUNT] = FTM_IRQS;
    /* Table to save FTM channel runtime state */
    static timer_chan_state_t s_ftmState[FTM_INSTANCE_COUNT][FTM_CONTROLS_COUNT];
    /* Table to save FTM channel running status */
    bool g_ftmChannelRunning[FTM_INSTANCE_COUNT][FTM_CONTROLS_COUNT];
    /* The maximum value of compare register */
    #define FTM_COMPARE_MAX (FTM_CNT_COUNT_MASK)
#endif

#if (defined(TIMING_OVER_PIT))
    /* Table to save PIT channel runtime state */
    static timer_chan_state_t s_pitState[PIT_INSTANCE_COUNT][PIT_TIMER_COUNT];
    /* Table to save PIT IRQ number */
    static const IRQn_Type s_pitIrq[PIT_INSTANCE_COUNT][PIT_IRQS_CH_COUNT] = PIT_IRQS;
    /* Table to save PIT clock source name */
    static clock_names_t s_pitClockName[PIT_INSTANCE_COUNT] = PIT_CLOCK_NAMES;
    /* The maximum value of compare register */
    #define PIT_COMPARE_MAX (PIT_LDVAL_TSV_MASK)
#endif

#if (defined(TIMING_OVER_STM))
    /* Table to save STM channel runtime state */
    static timer_chan_state_t s_stmState[STM_INSTANCE_COUNT][STM_CHANNEL_COUNT];
    /* Table to save STM IRQ number */
    static const IRQn_Type s_stmIrq[STM_INSTANCE_COUNT][STM_CHANNEL_COUNT] = STM_IRQS;
#if FEATURE_STM_HAS_CLOCK_SELECTION
    /* Table to save STM clock source name */
    static stm_clock_source_t s_stmClockSource[STM_INSTANCE_COUNT];
#endif
    /* Table to save STM prescaler */
    static uint8_t s_stmPrescaler[STM_INSTANCE_COUNT];
    /* The maximum value of compare register */
    #define STM_COMPARE_MAX (STM_CMP_CMP_MASK)
#endif

