sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/pal/src/timing/timing_pal.c
    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_GetMaxPeriod
 * Description   : Get max period in engineering units
 * This function get max period in engineering units.
 *
 * Implements    : TIMING_GetMaxPeriod_Activity
 *END**************************************************************************/
status_t TIMING_GetMaxPeriod(const timing_instance_t * const instance,
                             const timer_resolution_type_t type,
                             uint64_t * const maxPeriod)
{
    DEV_ASSERT(instance != NULL);
    DEV_ASSERT(maxPeriod != NULL);

    status_t status = STATUS_SUCCESS;
    uint32_t clkFrequency = 0U;
    uint64_t prescaler = 1U;
    uint64_t maxCountValue = 0U;

    /* Define TIMING PAL over LPIT */
#if (defined (TIMING_OVER_LPIT))
    if (instance->instType == TIMING_INST_TYPE_LPIT)
    {
        static const clock_names_t lpitClockName[LPIT_INSTANCE_COUNT] = {LPIT0_CLK};
        status_t clkErr;

        DEV_ASSERT((instance->instIdx) < LPIT_INSTANCE_COUNT);
        /* Set max count value of LPIT */
        maxCountValue = (uint64_t)LPIT_COMPARE_MAX + 1UL;
        /* Gets current functional clock frequency of LPIT instance */
        clkErr = CLOCK_SYS_GetFreq(lpitClockName[instance->instIdx], &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
    }
    else
#endif

    /* Define TIMING PAL over LPTMR */
#if (defined (TIMING_OVER_LPTMR))
    if (instance->instType == TIMING_INST_TYPE_LPTMR)
    {
        DEV_ASSERT((instance->instIdx) < LPTMR_INSTANCE_COUNT);
        /* Set max count value of LPTMR */
        maxCountValue = LPTMR_COMPARE_MAX + 1UL;
        /* Get lptmr clock frequency */
        TIMING_GetLptmrFreq(instance->instIdx, &clkFrequency, &prescaler);
    }
    else
#endif

    /* Define TIMING PAL over FTM */
#if (defined (TIMING_OVER_FTM))
    if (instance->instType == TIMING_INST_TYPE_FTM)
    {
        uint32_t ftmInstance = instance->instIdx;

        /* Set max count value of FTM */
        maxCountValue = FTM_COMPARE_MAX + 1UL;
        /* Gets current functional clock frequency of FTM instance */
        clkFrequency = FTM_DRV_GetFrequency(ftmInstance);
        DEV_ASSERT(clkFrequency > 0U);
        status = STATUS_SUCCESS;
    }
    else
#endif

    /* Define TIMING PAL over PIT */
#if (defined (TIMING_OVER_PIT))
    if (instance->instType == TIMING_INST_TYPE_PIT)
    {
        DEV_ASSERT((instance->instIdx) < PIT_INSTANCE_COUNT);

        status_t clkErr;
        uint32_t pitInstance = instance->instIdx;

        /* Set max count value of PIT */
        maxCountValue = (uint64_t)PIT_COMPARE_MAX + 1UL;
        /* Gets current functional clock frequency of PIT instance */
        clkErr = CLOCK_SYS_GetFreq(s_pitClockName[pitInstance], &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
    }
    else
#endif

    /* Define TIMING PAL over STM */
#if (defined (TIMING_OVER_STM))
    if (instance->instType == TIMING_INST_TYPE_STM)
    {
        DEV_ASSERT((instance->instIdx) < STM_INSTANCE_COUNT);

        status_t clkErr;
        uint32_t stmInstance = instance->instIdx;
        clock_names_t inputClockName = CLOCK_NAME_COUNT;

        /* Set max count value of STM */
        maxCountValue = (uint64_t)STM_COMPARE_MAX + 1UL;

#if FEATURE_STM_HAS_CLOCK_SELECTION
        /* Select name of clock source*/
        switch(s_stmClockSource[stmInstance])
        {
        case STM_CLOCK_SYSTEM:
            inputClockName = FS80_CLK;
            break;
        case STM_CLOCK_FXOSC:
            inputClockName = FXOSC_CLK;
            break;
        default:
            /* Invalid clock source */
            DEV_ASSERT(false);
            break;
        }
#else
        inputClockName = PBRIDGEx_CLK;
#endif
        /* Gets current functional clock frequency of STM instance */
        clkErr = CLOCK_SYS_GetFreq(inputClockName, &clkFrequency);
        /* Checks the functional clock module is available */
        (void)clkErr;
        DEV_ASSERT(clkErr == STATUS_SUCCESS);
        DEV_ASSERT(clkFrequency > 0U);
        prescaler = (uint64_t)s_stmPrescaler[stmInstance] + 1UL;
    }
    else
#endif
    {
        DEV_ASSERT(false);
    }

    if (type == TIMER_RESOLUTION_TYPE_NANOSECOND)
    {
        /* For better precision, add half of the frequency before the division.
           To avoid overflow, divided the clock frequency before multiples by the max count value */
        *maxPeriod = (((1000000000U * prescaler) + ((uint64_t)clkFrequency >> 1U)) / clkFrequency) * maxCountValue;
    }
    else if (type == TIMER_RESOLUTION_TYPE_MICROSECOND)
    {
        /* For better precision, add half of the frequency before the division. */
        *maxPeriod = ((1000000U * prescaler * maxCountValue) + ((uint64_t)clkFrequency >> 1U)) / clkFrequency;
    }
    else
    {   /* For better precision, add half of the frequency before the division. */
        *maxPeriod = ((1000U * prescaler * maxCountValue) +  ((uint64_t)clkFrequency >> 1U)) / clkFrequency;
    }

    if(*maxPeriod == 0U)
    {
        status = STATUS_ERROR;
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : TIMING_InstallCallback
 * Description   : Install new callback function and callback parameter for timer channel.
 *
 * Implements    : TIMING_InstallCallback_Activity
 *END**************************************************************************/
void TIMING_InstallCallback(const timing_instance_t * const instance,
                           const uint8_t channel,
                           const timer_callback_t callback,
                           void * const callbackParam)
{
    DEV_ASSERT(instance != NULL);

